2750257x-blip/Origional_STM32_Control_Code-main/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fdcan.h"
#include "spi.h"
#include "stm32h7xx_hal.h"
#include "tim.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include <stdint.h>
#include "motor_el05.h"
#include <stdlib.h>
#include <string.h>
#include <usbd_cdc_if.h>
#include "imu.h"
#include "protocol.h"
#include "jetson_robot_bridge.h"
#include "QRCode_State.h"
#include "lcd_spi_154.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum
{
    ROBOT_STATE_IDLE = 0,    // 正常运行：上位机正常控电机上传IMU数据
    ROBOT_STATE_RHAND,          // 举右手
    ROBOT_STATE_LHAND,          // 举左手
    ROBOT_STATE_BOTHH,          // 举双手
    ROBOT_STATE_HEAD,           // 摇头
    ROBOT_STATE_RESET,            // 测试状态
    ROBOT_STATE_TEST_ACTION,      // 测试状态
    ROBOT_STATE_TEST_IMU,         // 测试状态
    ROBOT_STATE_TEST_UART,            // 测试状态
    ROBOT_STATE_TEST_INIT,            // 测试状态
}Robot_StateTypeDef;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
Robot_StateTypeDef robot_state = ROBOT_STATE_IDLE;   //  \o/  \o/  \o/  \o/  \o/  
uint8_t button_pressed = 0;
uint8_t button_pressed_last = 0;
uint16_t action_timer = 0;

uint8_t motor_control_buf[120] = {0};
float_t motor_control_buf_float[24] = {0};

uint8_t usb_tx_buffer[120] = {0};


volatile uint32_t system_control_cycle = 0;
volatile uint32_t system_control_cycle_copy = 0;
volatile uint16_t system_control_warning = 0;  
volatile int32_t imu_data_count_copy = 0;
volatile uint16_t imu_warning = 0;  

volatile uint32_t controldata1number = 0;
volatile uint8_t  controldata1ready = 0;
float leg_control[12] = {0.0f};

float walklength1 = 0.005f;
float walklength2 = 0.005f;

volatile uint8_t Goto_ready = 0;
volatile uint8_t Goto_number = 0;
volatile float Goto_walklength[12] = {0.0f};

uint8_t uart_rx_buf1[120] = {0};
uint8_t uart_rx_data1[120] = {0};
volatile uint8_t uart_count1 = 0;
volatile uint8_t uart_start1 = 0;
volatile uint8_t uart_ready1 = 0;
uint8_t uart_rx_buf2[120] = {0};
uint8_t uart_rx_data2[120] = {0};
volatile uint8_t uart_count2 = 0;
volatile uint8_t uart_start2 = 0;
volatile uint8_t uart_ready2 = 0;


extern float kp_add;
extern float kd_add;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
/* USER CODE BEGIN PFP */
void Robot_State_Machine(void);

void BUTTON_CHANGE(void);
void Close_All_Old_Func(void);
void Action_Goto(float rangle1, float rangle2, float rangle3, float rangle4, float rangle5, float rangle6, float langle1, float langle2, float langle3, float langle4, float langle5, float langle6, uint8_t Goto_time);

void ROBOT_IDLE(void);    
void ROBOT_RHAND(void);
void ROBOT_LHAND(void);
void ROBOT_HEAD(void);
void ROBOT_RESET(void);
void ROBOT_BOTHH(void);
void ROBOT_TEST_ACTION(void);
void ROBOT_TEST_IMU(void);
void ROBOT_TEST_UART(void);
void ROBOT_TEST_INIT(void);

void LCD_State_Machine(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/

  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_FDCAN2_Init();
  MX_FDCAN1_Init();
  MX_USB_DEVICE_Init();
  MX_FDCAN3_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_USART2_UART_Init();
  MX_SPI6_Init();
  /* USER CODE BEGIN 2 */
  JetsonRobotBridge_Init();
  HAL_Delay(200);       // 电机上电延时
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET);
  imu_init(0x0F, 0xFD, &hfdcan3);
  // ==== 配置主动模式 100Hz 输出 6轴+四元数 ====
  imu_change_to_request();                // 切到请求模式才能配置
  HAL_Delay(20);
  imu_set_active_mode_delay(10);          // 100Hz (10ms)
  imu_write_reg(DATA_OUTPUT_SELECTION, 1);// 1=四元数, 0=欧拉角（6轴始终输出）
  imu_save_parameters();                  // 保存到IMU内部Flash
  HAL_Delay(20);
  imu_change_to_active();                 // 切换到主动模式
  HAL_Delay(20);
  /* Preserve gravity-referenced roll and pitch. Zeroing at each boot would
     make a tilted startup pose appear level and corrupt projected gravity. */

