2750257x-blip/Origional_STM32_Control_Code-main/Core/Src/main.c
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);    // 启动PWM信号输出（舵机控制）
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);    // 启动PWM信号输出（舵机控制）
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);    // 启动PWM信号输出（舵机控制）
  SPI_LCD_Init();			// SPI LCD屏幕初始化
  motor_enable();
  HAL_Delay(100);
  HAL_TIM_Base_Start_IT(&htim3);
  LCD_DisplayText(10, 10, "Mode: IDLE");
  LCD_DisplayText(10, 34, "motor_ready: ");
  LCD_DisplayHex(166, 34, 0, 4);
  LCD_DisplayText(10, 58, "motor_state: ");
  LCD_DisplayHex(166, 58, 0, 4);
  LCD_DisplayText(10, 82, "motor_fault: ");
  LCD_DisplayHex(166, 82, 0, 4);
  LCD_DisplayText(10, 106, "imu_ready: ");
  LCD_DisplayHex(142, 106, 0, 2);
  LCD_DisplayText(10, 130, "cycle: ");
  LCD_DisplayNumber(94, 130, 0, 6);
  LCD_DisplayText(10, 154, "warning: ");
  LCD_DisplayNumber(118, 154, 0, 4);

  for(int i=0; i<12; i++)
  {
    leg_control[i] = (float)((motor_status_buf[i*4] << 8) | motor_status_buf[i*4+1]) * (P_MAX - P_MIN) / 65535.0f + P_MIN;
  }

  //Action_Goto(0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 50);
  Action_Goto(0.20f, 0.0f, 0.0f, -0.30f, -0.15f, 0.0f, -0.20f, 0.0f, 0.0f, 0.30f, 0.15f, 0.00f, 50);
  //Action_Goto(0.15f, 0.05f, 0.0f, -0.30f, -0.15f, 0.0f, -0.15f, -0.05f, 0.0f, 0.30f, 0.15f, 0.00f, 50);
  system_control_warning = 0;
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  imu_set_zero();                         // 清零四元数，使复位后姿态归零
  HAL_Delay(500);
  while (1)
  {
    BUTTON_CHANGE(); 
    Robot_State_Machine();
    //LCD_State_Machine();
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 10;
  RCC_OscInitStruct.PLL.PLLN = 160;
  RCC_OscInitStruct.PLL.PLLP = 1;
  RCC_OscInitStruct.PLL.PLLQ = 5;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_1;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

void Robot_State_Machine(void)
{
    switch(robot_state)
    {
      // 状态0：日常电机+IMU+USB双向通信
      case ROBOT_STATE_IDLE:
      {
        ROBOT_IDLE();
        Servo_SetAngle(&htim1, TIM_CHANNEL_1, (uint8_t)(180-(-MotorIMU_Packet_float[12]/3+30)));
        Servo_SetAngle(&htim1, TIM_CHANNEL_2, (uint8_t)(MotorIMU_Packet_float[0]/3+30));
        break;
      }
      // 状态1：举右手
      case ROBOT_STATE_RHAND:
      {
        ROBOT_RHAND();
        break;
      }
      // 状态2：举左手
      case ROBOT_STATE_LHAND:
      {
        ROBOT_LHAND();
        break;
      }
      // 状态4：摇头
      case ROBOT_STATE_HEAD:
      {
        ROBOT_HEAD();
        break;
      }
      // 状态5：重置
      case ROBOT_STATE_RESET:
      {
        ROBOT_RESET();
        break;
      }
      // 状态3：举双手
      case ROBOT_STATE_BOTHH:
      {
        ROBOT_BOTHH();
        break;
      }

      // 状态7：测试二维码识别对应的预设动作
      case ROBOT_STATE_TEST_ACTION:
      {
        ROBOT_TEST_ACTION();
        break;
      }

      // 状态8：测试IMU通信
      case ROBOT_STATE_TEST_IMU:
      {
        ROBOT_TEST_IMU();
        break;
      }

      // 状态9：测试UART通信
      case ROBOT_STATE_TEST_UART:
      {
        ROBOT_TEST_UART();
        break;
      }

      // 状态10：测试初始化
      case ROBOT_STATE_TEST_INIT:
      {
        ROBOT_TEST_INIT();
        break;
      }

      default:
      {
          robot_state = ROBOT_STATE_IDLE;
          action_state = ACTION_IDLE;
          break;
      }
    }
}

void ROBOT_IDLE(void) 
{
  // 处理通过USB CDC收到并经过CRC校验的Nano关节目标
  JetsonRobotBridge_ProcessCommand();

  // if (imu_data_ready == 0x00) {
  //     imu_request_accel();
  // }
  // else if (imu_data_ready== 0x01) {      
  //   imu_request_gyro();
  // }
  // else if (imu_data_ready== 0x03) {      
  //   imu_request_quat();
  // }
  //汇总电机状态和IMU数据，使用与通信测试工程相同的帧协议上传Nano
  __disable_irq();
  uint16_t motor_status_ready_copy = motor_status_ready; 
  uint8_t imu_data_ready_copy = imu_data_ready; 
  __enable_irq();
  if (motor_status_ready_copy == 0x0FFF &&
      (imu_data_ready_copy & IMU_DATA_REQUIRED) == IMU_DATA_REQUIRED &&
      IMU_DataIsFresh(HAL_GetTick(), 50U)) {
    if (JetsonRobotBridge_SendState() == USBD_OK) { // USB发送成功
    __disable_irq();
   // motor_status_ready = 0; // 重置计数
    imu_data_ready = 0;
   // system_control_cycle ++;
    __enable_irq();
    }
  }

  // 收到Nano发来的二维码动作指令，切换动作模式
  // if(action_state != ACTION_IDLE)
  // {
  //   robot_state = ROBOT_STATE_ACTION;
  //   LCD_DisplayText(10, 10, "Mode : ACTION");
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  // }
  // if(system_control_warning >= 10 || motor_status_fault != 0 || motor_status_mode != 0x0FFF) {
  //   robot_state = ROBOT_STATE_ERROR; // 如果连续3个周期没有正常控制，切换到异常状态
  //   LCD_ClearRect(10, 10, 240, 24);
  //   LCD_DisplayText(10, 10, "Mode : ERROR");
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  // }
  if(imu_warning >=2 && imu_warning <=100) {
  imu_change_to_request();                // 切到请求模式才能配置
  HAL_Delay(20);
  imu_set_active_mode_delay(10);          // 100Hz (10ms)
  imu_write_reg(DATA_OUTPUT_SELECTION, 1);// 1=四元数, 0=欧拉角（6轴始终输出）
  imu_save_parameters();                  // 保存到IMU内部Flash
  HAL_Delay(20);
  imu_change_to_active();                 // 切换到主动模式
  }
}

void ROBOT_RHAND(void)
{
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(10, 10, "Mode : RHAND");
  Servo_SetAngle(&htim1, TIM_CHANNEL_1, 0);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  HAL_Delay(3200);
  robot_state = ROBOT_STATE_IDLE;
  Servo_SetAngle(&htim1, TIM_CHANNEL_1, 30);
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(0, 10, "Mode : IDLE");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
}

void ROBOT_LHAND(void)
{
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(10, 10, "Mode : LHAND");
  Servo_SetAngle(&htim1, TIM_CHANNEL_2, 180);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  HAL_Delay(3200);
  Servo_SetAngle(&htim1, TIM_CHANNEL_2, 150);
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(0, 10, "Mode : IDLE");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
}

void ROBOT_HEAD(void)
{
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(10, 10, "Mode : HEAD");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 0);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 180);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 0);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 180);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 0);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 90);
  HAL_Delay(200);
  robot_state = ROBOT_STATE_IDLE;
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(0, 10, "Mode : IDLE");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
}

