2750257x-blip/Origional_STM32_Control_Code-main/Core/Src/main.c
    controldata1number = 0;
    controldata1ready = 0;

    uart_count1 = 0;
    uart_start1 = 0;
    uart_ready1 = 0;
    uart_count2 = 0;
    uart_start2 = 0;
    uart_ready2 = 0;

    motor_status_ready = 0;
    imu_data_ready = 0;
}

void LCD_State_Machine(void)
{
  LCD_DisplayHex(166, 34, motor_status_ready, 4);
  LCD_DisplayHex(166, 58, motor_status_mode, 4);
  LCD_DisplayHex(166, 82, motor_status_fault, 4);
  LCD_DisplayHex(142, 106, (uint16_t)imu_data_ready, 2);
  LCD_DisplayNumber(94, 130, (uint32_t)system_control_cycle, 6);
  LCD_DisplayNumber(118, 154, (uint32_t)imu_warning, 4);
  LCD_DisplayHex(10, 178, motor_fault_test, 4);
  LCD_DisplayNumber(10, 202, imu_data_count, 8);
}

void Action_Goto(float rangle1, float rangle2, float rangle3, float rangle4, float rangle5, float rangle6, float langle1, float langle2, float langle3, float langle4, float langle5, float langle6, uint8_t Goto_time)
{
  Goto_walklength[0] = (rangle1 - leg_control[0]) / Goto_time;
  Goto_walklength[1] = (rangle2 - leg_control[1]) / Goto_time;
  Goto_walklength[2] = (rangle3 - leg_control[2]) / Goto_time;
  Goto_walklength[3] = (rangle4 - leg_control[3]) / Goto_time;
  Goto_walklength[4] = (rangle5 - leg_control[4]) / Goto_time;
  Goto_walklength[5] = (rangle6 - leg_control[5]) / Goto_time;
  Goto_walklength[6] = (langle1 - leg_control[6]) / Goto_time;
  Goto_walklength[7] = (langle2 - leg_control[7]) / Goto_time;
  Goto_walklength[8] = (langle3 - leg_control[8]) / Goto_time;
  Goto_walklength[9] = (langle4 - leg_control[9]) / Goto_time;
  Goto_walklength[10] = (langle5 - leg_control[10]) / Goto_time;
  Goto_walklength[11] = (langle6 - leg_control[11]) / Goto_time;
  HAL_TIM_Base_Start_IT(&htim4); // 启动定时器中断（用于周期性任务）
  while(Goto_number < Goto_time) {
    if(Goto_ready){
      Goto_ready = 0;
      EL05_Motor_Ctrl(&hfdcan1, r_leg_pitch, 0.0f, leg_control[0], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan1, r_leg_roll, 0.0f, leg_control[1], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan1, r_leg_yaw, 0.0f, leg_control[2], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan1, r_knee_pitch, 0.0f, leg_control[3], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan1, r_ankle_pitch, 0.0f, leg_control[4], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan1, r_ankle_roll, 0.0f, leg_control[5], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan2, l_leg_pitch, 0.0f, leg_control[6], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan2, l_leg_roll, 0.0f, leg_control[7], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan2, l_leg_yaw, 0.0f, leg_control[8], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan2, l_knee_pitch, 0.0f, leg_control[9], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan2, l_ankle_pitch, 0.0f, leg_control[10], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
      EL05_Motor_Ctrl(&hfdcan2, l_ankle_roll, 0.0f, leg_control[11], 0.0f, 40.0f*kp_add, 2.0f*kd_add);
    }
  }
    HAL_TIM_Base_Stop_IT(&htim4);
    __HAL_TIM_SET_COUNTER(&htim4, 0);
    __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);

    Goto_ready = 0;
    Goto_number = 0;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2) {
        controldata1ready = 1; // 设置数据就绪标志
        leg_control[0] += walklength1*1;                                //0  1  0  -1  0 
        leg_control[1] += -walklength2*0.2;                                //0  -1  0  -1  0
        leg_control[2] += walklength1*0;                                    //0  0  0  0  0
        leg_control[3] -= walklength1*0.3+walklength2*0.3;             //0  1  0  0  0
        leg_control[4] += walklength1*0.4;                              //0  1  0  -1  0
        leg_control[5] += -walklength2*0.2;                              //0  -1  0  -1  0

        leg_control[6] += walklength1*1;                                //0  1  0  -1  0
        leg_control[7] += walklength2*0.2;                                 //0  1  0  1  0
        leg_control[8] += walklength1*0;                                    //0  0  0  0  0
        leg_control[9] -= walklength1*0.3-walklength2*0.3;             //0  0  0  -1  0
        leg_control[10] += walklength1*0.4;                              //0  1  0  -1  0 
        leg_control[11] += walklength2*0.2;                               //0  1 _ankle_roll_control += walklength2*0.2;                               //0  1  

        if (leg_control[0] > 0.4f)
        {
            walklength1 = -walklength1; // 反转步长方向                         //0  -1  0  -1  0
            walklength2 = -walklength2;                                        //0   1  0   1  0
        } 
        else if (leg_control[0] < -0.4f)
        {
            walklength1 = -walklength1; // 反转步长方向
            walklength2 = -walklength2;
        }
        if (leg_control[0] <= 1e-6f)
        {
            walklength2 = -walklength2;
        }
    }

  if (htim->Instance == TIM3 && robot_state == ROBOT_STATE_IDLE) {
    if (system_control_cycle == system_control_cycle_copy) {
        system_control_warning ++; // 如果周期计数没有增加，设置警告标志
    } else {
        system_control_warning = 0; // 周期正常，清除警告标志
    }
    system_control_cycle_copy = system_control_cycle;
    if (imu_data_count == imu_data_count_copy) {
        imu_warning ++; // 如果周期计数没有增加，设置警告标志
    } else {
        imu_warning = 0; // 周期正常，清除警告标志
    }
    imu_data_count_copy = imu_data_count;
  }

  if (htim->Instance == TIM4) {
        Goto_ready = 1; // 设置数据就绪标志
        Goto_number++; // 增加 goto 计数
        leg_control[0] += Goto_walklength[0];                                
        leg_control[1] += Goto_walklength[1];                               
        leg_control[2] += Goto_walklength[2];                                  
        leg_control[3] += Goto_walklength[3];            
        leg_control[4] += Goto_walklength[4];                              
        leg_control[5] += Goto_walklength[5];                            

        leg_control[6] += Goto_walklength[6];                                
        leg_control[7] += Goto_walklength[7];                                
        leg_control[8] += Goto_walklength[8];                                   
        leg_control[9] += Goto_walklength[9];             
        leg_control[10] += Goto_walklength[10];                             
        leg_control[11] += Goto_walklength[11];                               
  }
}

